### Report for project: `terraform`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.api.module.efs_data_volume.aws_efs_file_system.default[0] has changed
  ~ resource "aws_efs_file_system" "default" {
        id                              = "fs-0b22d749517d906e0"
      ~ size_in_bytes                   = [
          ~ {
              ~ value             = 1586970624 -> 1612296192
              ~ value_in_standard = 1586970624 -> 1612296192
                # (1 unchanged element hidden)
            },
        ]
        tags                            = {
            "Name" = "gost-prod-datavolume"
        }
        # (11 unchanged attributes hidden)
    }

  # module.website.module.logs_bucket.aws_s3_bucket.default[0] has changed
  ~ resource "aws_s3_bucket" "default" {
        id                          = "gost-prod-logs-729134339726-us-west-2-website"
        tags                        = {
            "Attributes" = "729134339726-us-west-2-website"
            "Name"       = "gost-prod-logs-729134339726-us-west-2-website"
            "Namespace"  = "gost-prod"
        }
        # (11 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.website.module.origin_bucket.aws_s3_bucket.default[0] has changed
  ~ resource "aws_s3_bucket" "default" {
        id                          = "gost-prod-origin-729134339726-us-west-2-website"
        tags                        = {
            "Attributes" = "729134339726-us-west-2-website"
            "Name"       = "gost-prod-origin-729134339726-us-west-2-website"
            "Namespace"  = "gost-prod"
        }
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.api.aws_ecs_service.default[0] will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:729134339726:service/gost-prod/gost-prod-api"
        name                               = "gost-prod-api"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-api:3" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_ecs_task_definition.default[0] must be replaced
+/- resource "aws_ecs_task_definition" "default" {
      ~ arn                      = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-api:3" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-api" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
-               {
-                   cpu                    = 0
-                   environment            = [
-                       {
-                           name  = "API_DOMAIN"
-                           value = "https://api.grants.usdigitalresponse.org"
                        },
-                       {
-                           name  = "DATA_DIR"
-                           value = "/var/data"
                        },
-                       {
-                           name  = "ENABLE_GRANTS_DIGEST"
-                           value = "true"
                        },
-                       {
-                           name  = "ENABLE_GRANTS_SCRAPER"
-                           value = "false"
                        },
-                       {
-                           name  = "GRANTS_SCRAPER_DATE_RANGE"
-                           value = "7"
                        },
-                       {
-                           name  = "GRANTS_SCRAPER_DELAY"
-                           value = "1000"
                        },
-                       {
-                           name  = "NODE_OPTIONS"
-                           value = "--max_old_space_size=1024"
                        },
-                       {
-                           name  = "NOTIFICATIONS_EMAIL"
-                           value = "grants-notifications@grants.usdigitalresponse.org"
                        },
-                       {
-                           name  = "VUE_APP_GRANTS_API_URL"
-                           value = "https://1ist1822ik.execute-api.us-west-2.amazonaws.com"
                        },
-                       {
-                           name  = "WEBSITE_DOMAIN"
-                           value = "https://grants.usdigitalresponse.org"
                        },
                    ]
-                   essential              = true
-                   image                  = "ghcr.io/usdigitalresponse/usdr-gost-api:stable"
-                   linuxParameters        = {
-                       capabilities       = {
-                           add  = []
-                           drop = []
                        }
-                       devices            = []
-                       initProcessEnabled = true
-                       tmpfs              = []
                    }
-                   logConfiguration       = {
-                       logDriver = "awslogs"
-                       options   = {
-                           awslogs-group         = "gost-prod-api-20230303023921715300000008"
-                           awslogs-region        = "us-west-2"
-                           awslogs-stream-prefix = "ecs"
                        }
                    }
-                   mountPoints            = [
-                       {
-                           containerPath = "/var/data"
-                           readOnly      = false
-                           sourceVolume  = "data"
                        },
                    ]
-                   name                   = "api"
-                   portMappings           = [
-                       {
-                           containerPort = 3000
-                           hostPort      = 3000
-                           protocol      = "tcp"
                        },
                    ]
-                   readonlyRootFilesystem = false
-                   secrets                = [
-                       {
-                           name      = "COOKIE_SECRET"
-                           valueFrom = "arn:aws:ssm:us-west-2:729134339726:parameter/gost/prod/api/cookie_secret"
                        },
-                       {
-                           name      = "POSTGRES_URL"
-                           valueFrom = "arn:aws:ssm:us-west-2:729134339726:parameter/gost/prod/postgres/connection_string"
                        },
                    ]
-                   volumesFrom            = []
                },
-               {
-                   cpu                    = 0
-                   environment            = [
-                       {
-                           name  = "DD_APM_ENABLED"
-                           value = "true"
                        },
-                       {
-                           name  = "ECS_FARGATE"
-                           value = "true"
                        },
                    ]
-                   essential              = false
-                   image                  = "public.ecr.aws/datadog/agent:latest"
-                   mountPoints            = []
-                   name                   = "datadog"
-                   portMappings           = []
-                   readonlyRootFilesystem = false
-                   secrets                = [
-                       {
-                           name      = "DD_API_KEY"
-                           valueFrom = "arn:aws:ssm:us-west-2:729134339726:parameter/gost/prod/datadog/api_key"
                        },
                    ]
-                   volumesFrom            = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "gost-prod-api" -> (known after apply)
      ~ revision                 = 3 -> (known after apply)
-       tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)

-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id          = "fs-0b22d749517d906e0" -> null
-               root_directory          = "/" -> null
-               transit_encryption      = "ENABLED" -> null
-               transit_encryption_port = 0 -> null

-               authorization_config {
-                   access_point_id = "fsap-05cdce2f27f5aab98" -> null
                }
            }
        }
+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = "fs-0b22d749517d906e0"
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = "fsap-05cdce2f27f5aab98"
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.api.aws_iam_role_policy.task["rw-arpa-audit-reports"] will be created
+   resource "aws_iam_role_policy" "task" {
+       id     = (known after apply)
+       name   = "rw-arpa-audit-reports"
+       policy = (known after apply)
+       role   = "gost-prod-api-ECSTask-2023030302392200850000000a"
    }

  # module.api.module.access_arpa_reports_bucket_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions       = (known after apply)
+           effect        = (known after apply)
+           not_actions   = (known after apply)
+           not_resources = (known after apply)
+           resources     = (known after apply)
+           sid           = (known after apply)

+           condition {
+               test     = (known after apply)
+               values   = (known after apply)
+               variable = (known after apply)
            }

+           not_principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }

+           principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }
        }
    }

  # module.api.module.arpa_audit_reports_bucket.data.aws_iam_policy_document.aggregated_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "aggregated_policy" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = [
+           (known after apply),
        ]
    }

  # module.api.module.arpa_audit_reports_bucket.data.aws_iam_policy_document.bucket_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "bucket_policy" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:PutObject",
            ]
+           effect    = "Deny"
+           resources = [
+               (known after apply),
            ]
+           sid       = "DenyIncorrectEncryptionHeader"

+           condition {
+               test     = "StringNotEquals"
+               values   = [
+                   "AES256",
                ]
+               variable = "s3:x-amz-server-side-encryption"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "*"
            }
        }
+       statement {
+           actions   = [
+               "s3:PutObject",
            ]
+           effect    = "Deny"
+           resources = [
+               (known after apply),
            ]
+           sid       = "DenyUnEncryptedObjectUploads"

+           condition {
+               test     = "Null"
+               values   = [
+                   "true",
                ]
+               variable = "s3:x-amz-server-side-encryption"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "*"
            }
        }
+       statement {
+           actions   = [
+               "s3:*",
            ]
+           effect    = "Deny"
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
+           sid       = "ForceSSLOnlyAccess"

+           condition {
+               test     = "Bool"
+               values   = [
+                   "false",
                ]
+               variable = "aws:SecureTransport"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "*"
            }
        }
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket.default[0] will be created
+   resource "aws_s3_bucket" "default" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "gost-prod-arpaauditreports-729134339726-us-west-2-api"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = false
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "Attributes" = "729134339726-us-west-2-api"
+           "Name"       = "gost-prod-arpaauditreports-729134339726-us-west-2-api"
+           "Namespace"  = "gost-prod"
        }
+       tags_all                    = {
+           "Attributes" = "729134339726-us-west-2-api"
+           "Name"       = "gost-prod-arpaauditreports-729134339726-us-west-2-api"
+           "Namespace"  = "gost-prod"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule {
+           allowed_headers = (known after apply)
+           allowed_methods = (known after apply)
+           allowed_origins = (known after apply)
+           expose_headers  = (known after apply)
+           max_age_seconds = (known after apply)
        }

+       grant {
+           id          = (known after apply)
+           permissions = (known after apply)
+           type        = (known after apply)
+           uri         = (known after apply)
        }

+       lifecycle_rule {
+           abort_incomplete_multipart_upload_days = (known after apply)
+           enabled                                = (known after apply)
+           id                                     = (known after apply)
+           prefix                                 = (known after apply)
+           tags                                   = (known after apply)

+           expiration {
+               date                         = (known after apply)
+               days                         = (known after apply)
+               expired_object_delete_marker = (known after apply)
            }

+           noncurrent_version_expiration {
+               days = (known after apply)
            }

+           noncurrent_version_transition {
+               days          = (known after apply)
+               storage_class = (known after apply)
            }

+           transition {
+               date          = (known after apply)
+               days          = (known after apply)
+               storage_class = (known after apply)
            }
        }

+       logging {
+           target_bucket = (known after apply)
+           target_prefix = (known after apply)
        }

+       object_lock_configuration {
+           object_lock_enabled = (known after apply)

+           rule {
+               default_retention {
+                   days  = (known after apply)
+                   mode  = (known after apply)
+                   years = (known after apply)
                }
            }
        }

+       replication_configuration {
+           role = (known after apply)

+           rules {
+               delete_marker_replication_status = (known after apply)
+               id                               = (known after apply)
+               prefix                           = (known after apply)
+               priority                         = (known after apply)
+               status                           = (known after apply)

+               destination {
+                   account_id         = (known after apply)
+                   bucket             = (known after apply)
+                   replica_kms_key_id = (known after apply)
+                   storage_class      = (known after apply)

+                   access_control_translation {
+                       owner = (known after apply)
                    }

+                   metrics {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }

+                   replication_time {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }
                }

+               filter {
+                   prefix = (known after apply)
+                   tags   = (known after apply)
                }

+               source_selection_criteria {
+                   sse_kms_encrypted_objects {
+                       enabled = (known after apply)
                    }
                }
            }
        }

+       server_side_encryption_configuration {
+           rule {
+               bucket_key_enabled = (known after apply)

+               apply_server_side_encryption_by_default {
+                   kms_master_key_id = (known after apply)
+                   sse_algorithm     = (known after apply)
                }
            }
        }

+       versioning {
+           enabled    = (known after apply)
+           mfa_delete = (known after apply)
        }

+       website {
+           error_document           = (known after apply)
+           index_document           = (known after apply)
+           redirect_all_requests_to = (known after apply)
+           routing_rules            = (known after apply)
        }
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket_acl.default[0] will be created
+   resource "aws_s3_bucket_acl" "default" {
+       acl    = "private"
+       bucket = (known after apply)
+       id     = (known after apply)

+       access_control_policy {
+           grant {
+               permission = (known after apply)

+               grantee {
+                   display_name  = (known after apply)
+                   email_address = (known after apply)
+                   id            = (known after apply)
+                   type          = (known after apply)
+                   uri           = (known after apply)
                }
            }

+           owner {
+               display_name = (known after apply)
+               id           = (known after apply)
            }
        }
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket_lifecycle_configuration.default[0] will be created
+   resource "aws_s3_bucket_lifecycle_configuration" "default" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           id     = "rule-1"
+           status = "Enabled"

+           abort_incomplete_multipart_upload {
+               days_after_initiation = 1
            }

+           expiration {
+               days                         = 14
+               expired_object_delete_marker = (known after apply)
            }

+           filter {
            }
        }
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket_ownership_controls.default[0] will be created
+   resource "aws_s3_bucket_ownership_controls" "default" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           object_ownership = "ObjectWriter"
        }
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket_policy.default[0] will be created
+   resource "aws_s3_bucket_policy" "default" {
+       bucket = (known after apply)
+       id     = (known after apply)
+       policy = (known after apply)
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket_public_access_block.default[0] will be created
+   resource "aws_s3_bucket_public_access_block" "default" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket_server_side_encryption_configuration.default[0] will be created
+   resource "aws_s3_bucket_server_side_encryption_configuration" "default" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           bucket_key_enabled = false

+           apply_server_side_encryption_by_default {
+               sse_algorithm = "AES256"
            }
        }
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket_versioning.default[0] will be created
+   resource "aws_s3_bucket_versioning" "default" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       versioning_configuration {
+           mfa_delete = (known after apply)
+           status     = "Enabled"
        }
    }

  # module.api.module.arpa_audit_reports_bucket.time_sleep.wait_for_aws_s3_bucket_settings[0] will be created
+   resource "time_sleep" "wait_for_aws_s3_bucket_settings" {
+       create_duration  = "30s"
+       destroy_duration = "30s"
+       id               = (known after apply)
    }

  # module.api.module.efs_data_volume.aws_efs_access_point.default["data"] will be updated in-place
  ~ resource "aws_efs_access_point" "default" {
        id              = "fsap-05cdce2f27f5aab98"
      ~ tags            = {
          ~ "Name"      = "gost-prod-datavolume" -> "gost-prod-gost-prod-datavolume"
+           "Namespace" = "gost-prod"
        }
      ~ tags_all        = {
          ~ "Name"      = "gost-prod-datavolume" -> "gost-prod-gost-prod-datavolume"
+           "Namespace" = "gost-prod"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.api.module.efs_data_volume.aws_efs_file_system.default[0] will be updated in-place
  ~ resource "aws_efs_file_system" "default" {
        id                              = "fs-0b22d749517d906e0"
      ~ tags                            = {
          ~ "Name"      = "gost-prod-datavolume" -> "gost-prod-gost-prod-datavolume"
+           "Namespace" = "gost-prod"
        }
      ~ tags_all                        = {
          ~ "Name"      = "gost-prod-datavolume" -> "gost-prod-gost-prod-datavolume"
+           "Namespace" = "gost-prod"
        }
        # (11 unchanged attributes hidden)
    }

  # module.api.module.grants_scraper.data.aws_iam_policy_document.permissions[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "permissions" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "ecs:RunTask",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowRunTask"

+           condition {
+               test     = "ArnLike"
+               values   = [
+                   "arn:aws:ecs:us-west-2:729134339726:cluster/gost-prod",
                ]
+               variable = "ecs:cluster"
            }
        }
+       statement {
+           actions   = [
+               "iam:PassRole",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:iam::729134339726:role/gost-prod-api-ECSTask-2023030302392200850000000a",
+               "arn:aws:iam::729134339726:role/gost-prod-api-ECSTaskExecution-20230303023921815800000009",
            ]
+           sid       = "AllowSchedulerPassRoleToExecutionRole"
        }
    }

  # module.api.module.grants_scraper.aws_iam_role_policy.default[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "default" {
        id     = "gost-prod-grants_scraper-2023030302392250420000000b:terraform-20230303024046969200000014"
        name   = "terraform-20230303024046969200000014"
      ~ policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "ecs:RunTask"
-                       Condition = {
-                           ArnLike = {
-                               "ecs:cluster" = "arn:aws:ecs:us-west-2:729134339726:cluster/gost-prod"
                            }
                        }
-                       Effect    = "Allow"
-                       Resource  = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-api:*"
-                       Sid       = "AllowRunTask"
                    },
-                   {
-                       Action   = "iam:PassRole"
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:iam::729134339726:role/gost-prod-api-ECSTaskExecution-20230303023921815800000009",
-                           "arn:aws:iam::729134339726:role/gost-prod-api-ECSTask-2023030302392200850000000a",
                        ]
-                       Sid      = "AllowSchedulerPassRoleToExecutionRole"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.api.module.grants_scraper.aws_scheduler_schedule.default[0] will be updated in-place
  ~ resource "aws_scheduler_schedule" "default" {
        id                           = "default/gost-prod-grants_scraper-20230303024046967600000013"
        name                         = "gost-prod-grants_scraper-20230303024046967600000013"
        # (10 unchanged attributes hidden)

      ~ target {
            # (3 unchanged attributes hidden)

          ~ ecs_parameters {
                tags                    = {}
              ~ task_definition_arn     = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-api:3" -> (known after apply)
                # (8 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.api.module.http_security_group.aws_security_group.cbd[0] will be updated in-place
  ~ resource "aws_security_group" "cbd" {
        id                     = "sg-0aced72212cb31022"
        name                   = "gost-prod-api--jBYY-2023030302392315470000000e"
      ~ tags                   = {
+           "Namespace"  = "gost-prod"
            # (2 unchanged elements hidden)
        }
      ~ tags_all               = {
+           "Namespace"  = "gost-prod"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.website.module.logs_bucket.aws_s3_bucket_versioning.default[0] will be created
+   resource "aws_s3_bucket_versioning" "default" {
+       bucket = "gost-prod-logs-729134339726-us-west-2-website"
+       id     = (known after apply)

+       versioning_configuration {
+           mfa_delete = (known after apply)
+           status     = "Enabled"
        }
    }

  # module.api.module.efs_data_volume.module.security_group.aws_security_group.cbd[0] must be replaced
+/- resource "aws_security_group" "cbd" {
      ~ arn                    = "arn:aws:ec2:us-west-2:729134339726:security-group/sg-00177edcd89524bb9" -> (known after apply)
      ~ egress                 = [
-           {
-               cidr_blocks      = [
-                   "0.0.0.0/0",
                ]
-               description      = "Allow all egress"
-               from_port        = 0
-               ipv6_cidr_blocks = [
-                   "::/0",
                ]
-               prefix_list_ids  = []
-               protocol         = "-1"
-               security_groups  = []
-               self             = false
-               to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-00177edcd89524bb9" -> (known after apply)
      ~ ingress                = [
-           {
-               cidr_blocks      = []
-               description      = "Allow ingress EFS traffic"
-               from_port        = 2049
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = [
-                   "sg-02a2851f809e91e7b",
                ]
-               self             = false
-               to_port          = 2049
            },
        ] -> (known after apply)
      ~ name                   = "gost-prod-datavolume-2023030302393121490000000f" -> (known after apply)
      ~ name_prefix            = "gost-prod-datavolume-" -> "gost-prod-gost-prod-datavolume-" # forces replacement
      ~ owner_id               = "729134339726" -> (known after apply)
      ~ tags                   = {
          ~ "Name"      = "gost-prod-datavolume" -> "gost-prod-gost-prod-datavolume"
+           "Namespace" = "gost-prod"
        }
      ~ tags_all               = {
          ~ "Name"      = "gost-prod-datavolume" -> "gost-prod-gost-prod-datavolume"
+           "Namespace" = "gost-prod"
        }
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.api.module.efs_data_volume.module.security_group.aws_security_group_rule.keyed["_allow_all_egress_"] must be replaced
+/- resource "aws_security_group_rule" "keyed" {
      ~ id                       = "sgrule-3148519123" -> (known after apply)
      ~ security_group_id        = "sg-00177edcd89524bb9" -> (known after apply) # forces replacement
+       security_group_rule_id   = (known after apply)
+       source_security_group_id = (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.api.module.efs_data_volume.module.security_group.aws_security_group_rule.keyed["_m[0]#in#sg#0"] must be replaced
+/- resource "aws_security_group_rule" "keyed" {
      ~ id                       = "sgrule-1265836674" -> (known after apply)
      ~ security_group_id        = "sg-00177edcd89524bb9" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-068f8614fcb1a4b94" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 15 to add, 6 to change, 4 to destroy.
```

</details>

*Pusher: @as1729, Action: `pull_request`, Workflow: `Terraform CI`*